# pandas拼接操作 针对dataframe

pandas的拼接分两种:
    1,级联:pd.concat和pd.append
    2,合并:pd.merge和pd.join

# 一,使用pd.concat()级联

pandas使用pd.concat函数,与np.concatenate函数类似,只是多了一些参数:
    pd.concat(
    ['objs', 'axis=0', "join='outer'", 'join_axes=None', 'ignore_index=False', 'keys=None', 'levels=None', 'names=None', 'verify_integrity=False', 'sort=None', 'copy=True'],
)
objs: series，dataframe或者是panel构成的序列lsit 
axis： 需要合并链接的轴，0是行，1是列 
join：连接的方式 inner，或者outer

In [23]:
import pandas as pd
from pandas import DataFrame,Series

In [10]:
df=pd.DataFrame({'a':[1,2,3],'b':[2,3,4]},index=['a1','a2','a3'])
df

    a  b
a1  1  2
a2  2  3
a3  3  4

参数join='outer'匹配级联,指索引不一致 返回NAN,join='inner'不匹配级联,只返回一致的部分

In [17]:
pd.concat([df,df],axis=1,join='outer')  #横拼

    a  b  a  b
a1  1  2  1  2
a2  2  3  2  3
a3  3  4  3  4

In [15]:
pd.concat([df,df],axis=0)

    a  b
a1  1  2
a2  2  3
a3  3  4
a1  1  2
a2  2  3
a3  3  4

# 使用df.append()

Signature: df.append(other, ignore_index=False, verify_integrity=False, sort=None)

In [22]:
df.append(df)

    a  b
a1  1  2
a2  2  3
a3  3  4
a1  1  2
a2  2  3
a3  3  4

# 使用pd.merge()合并

与concat区别,merge()需要依据某一共同的列来进行合并
使用pd.merge(合并时,会自动根据两者相同columns名称的那一列作为key来进行合并)
每一列元素的顺序不要求一致
pd.merge(
    ['left', 'right', "how='inner'", 'on=None', 'left_on=None', 'right_on=None', 'left_index=False', 'right_index=False', 'sort=False', "suffixes=('_x', '_y')", 'copy=True', 'indicator=False', 'validate=None'],
)
参数:out取并集,inner取交集
参数:on 指定 使用哪一列进行合并,蛋更有多列相同的时候

# 一对一合并

In [24]:
df1 = DataFrame({'employee':['Bob','Jake','Lisa'],
                'group':['Accounting','Engineering','Engineering'],
                })

In [25]:
df2 = DataFrame({'employee':['Lisa','Bob','Jake'],
                'hire_date':[2004,2008,2012],
                })

In [26]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering

In [28]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012

In [29]:
pd.merge(df1,df2)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004

# 多对一合并

In [30]:
df3 = DataFrame({
    'employee':['Lisa','Jake'],
    'group':['Accounting','Engineering'],
    'hire_date':[2004,2016]})

In [31]:
df4 = DataFrame({'group':['Accounting','Engineering','Engineering'],
                       'supervisor':['Carly','Guido','Steve']
                })

In [33]:
df3

  employee        group  hire_date
0     Lisa   Accounting       2004
1     Jake  Engineering       2016

In [34]:
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2  Engineering      Steve

In [35]:
pd.merge(df3,df4)

  employee        group  hire_date supervisor
0     Lisa   Accounting       2004      Carly
1     Jake  Engineering       2016      Guido
2     Jake  Engineering       2016      Steve

# 多对多合并

In [37]:
df5 = DataFrame({'employee':['Bob','Jake','Lisa'],
                 'group':['Accounting','Engineering','Engineering']})

In [46]:
df6 = DataFrame({'group':['Engineering','Engineering','HR'],
                'supervisor':['Carly','Guido','Steve']
                })

In [43]:
df5

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering

In [48]:
df6

         group supervisor
0  Engineering      Carly
1  Engineering      Guido
2           HR      Steve

In [47]:
pd.merge(df5,df6)

  employee        group supervisor
0     Jake  Engineering      Carly
1     Jake  Engineering      Guido
2     Lisa  Engineering      Carly
3     Lisa  Engineering      Guido

当两张表没有可进行连接的列时，可使用left_on和right_on手动指定merge中左右两边的哪一列列作为连接的列
left_on指定左边列的name同事right_one指定右边列的name进行连接

In [51]:
df1 = DataFrame({'employee':['Bobs','Linda','Bill'],
                'group':['Accounting','Product','Marketing'],
               'hire_date':[1998,2017,2018]})

In [50]:
df2 = DataFrame({'name':['Lisa','Bobs','Bill'],
                'hire_dates':[1998,2016,2007]})

In [52]:
df1

  employee       group  hire_date
0     Bobs  Accounting       1998
1    Linda     Product       2017
2     Bill   Marketing       2018

In [53]:
df2

   name  hire_dates
0  Lisa        1998
1  Bobs        2016
2  Bill        2007

In [62]:
pd.merge(df1,df2,left_on='employee',right_on='name',how='outer')

  employee       group  hire_date  name  hire_dates
0     Bobs  Accounting     1998.0  Bobs      2016.0
1    Linda     Product     2017.0   NaN         NaN
2     Bill   Marketing     2018.0  Bill      2007.0
3      NaN         NaN        NaN  Lisa      1998.0